# 리스트와 인덱싱
from dis import dis


a = [1,2,3]
a[0]
a[0]+a[2]   # a[0]+a[2]의 값인 1 + 3
# 파이썬은 숫자를 0부터 세기 때문에 a[0]이 리스트의 첫번째 요소이고 a[-1]은 문자열에서와 마찬가지로
# 리스트 a의 마지막 요솟값을 말한다. 
a[-1]
a = [1,2,3, ['a','b','c']]
a[0]
a[-1]
a[3]
#  ['a', 'b', 'c'] 에서 a를 인덱싱을 사용해서 꺼내기
a[-1][0]

# 리스트와 슬라이싱
a = [1,2,3,4,5]
a[0:2]
b = a[:2]
c = a[2:]
b 
c

# 리스트 연산하기 
# 1. 리스트 더하기 (+)
a = [1,2,3,3]
b = [4,5,6]
a + b
# 2. 리스트 반복하기 (*)
a = [1,2,3]
a * 3
# 3. 리스트 길이 구하기 -> len 함수 사용
a = [1,2,3]
len(a)

# 리스트의 수정과 삭제
# 리스트에서 값 수정하기
a = [1,2,3]
a[2] = 4
a
# del 함수로 리스트 요소 삭제하기
a = [1,2,3]
del a[1]    # -> del 함수는 파이썬 내장함수이며 del 객체 로 사용한다. 
a
#  슬라이싱 기법으로 여러 개를 한번에 삭제할 수도 있다. 
a = [1,2,3,4,5]
del a[2:]
a

# 리스트 관련 함수
# 리스트에 요소 추가(append)
a = [1,2,3]
a.append(4)
a
# 리스트 정렬(sort) -> 문자, 숫자 가능
a = [1,3,5,2,4]
b = ['d','a','b','c']
a.sort()
b.sort()
a
b
# 리스트 뒤집기(reverse)
a = ['a','b','c']
a.reverse()
a
# 위치 반환(index)
a = [1,2,3]
a.index(3)
# 리스트에 요소 삽입(insert) -> insert(a, b) 는 a번째 위치에 b를 삽입하는 함수이다.
a = [1,2,3]
a.insert(0, 4)
a
# 리스트에 요소 제거(remove) -> reverse(x)는 리스트에서 첫 번째로 나오는 x를 삭제하는 함수이다.
a = [1,2,3,1,2,3]
a.remove(3)
a
# - 리스트 요소 끄집어내기(pop) -> 리스트의 맨 마지막 요소는 돌려주고 그 요소는 삭제한다.
a = [1,2,3]
a.pop(1)
a
# - 리스트에 포함된 요소 x의 개수 세기(count) -> count(x)는 리스트 안에 x가 몇 개 있는지 조사하여 그 개수를 돌려주는 함수이다.
a = [1,2,3,4]
a.count(1)
# - 리스트 확장(extend) -> extend(x)에서 x에는 리스트만 올 수 있으며 원래의 a 리스트에 x리스트를 더하게 된다.
a = [1,2,3]
a.extend([4,5])
b= [6,7]
a.extend(b)
a