# 02-6 집합 자료형
# set()의 괄호 안에 리스트를 입력하여 만들거나 문자열을 입력하여 만들 수도 있다.
s1 = set([1,2,3])
s1
s2 = set("Hello")
s2
# 집합 자료형의 특징
# 1. 중복을 허용하지 않는다.
s1 = set([1,2,3])
l1 = list(s1)   # 리스트로 변환
l1
t1 = tuple(s1)  # 튜플로 변환
t1
# 2. 순서가 없다.
# 리스트나 튜플은 순서가 있기 때문에 인덱싱을 통해 자료형의 값을 얻을 수 있지만 set 자료형은 순서가 없기 때문에 인덱싱으로 값을 얻을 수 없다.
# 교집합, 합집합, 차집합 구하기

# 교집합, 합집합, 차집합 구하기
s1 = set([1,2,3,4,5,6])
s2 = set([4,5,6,7,8,9])
# 교집합 -> & 기호를 사용하거나 intersection() 함수를 사용한다. 
s1 & s2
s1.intersection(s2)
# 합집합 -> | 기호를 사용하거나 union() 함수를 사용한다.
s1 | s2
s1.union(s2)
# 차집합 -> - 기호나 difference() 함수를 사용한다.
s1 - s2
s1.difference(s2)

# 집합 자료형 관련 함수 
# 1. 값 1개 추가하기(add)
s1 = set([1,2,3])
s1.add(4)
s1
# 2. 값 여러 개 추가하기(update)
s1 = set([1,2,3])
s1.update([4,5,6])
s1
# 3. 특정 값 제거하기(remove)
s1.remove(2)
s1

